__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, 1166, 24)     0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, 1166, 24)     0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 1147, 5)      2405        protein1[0][0]                   
                                                                 protein2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 382, 5)       0           conv1d_1[0][0]                   
                                                                 conv1d_1[1][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 382, 5)       20          max_pooling1d_1[0][0]            
                                                                 max_pooling1d_1[1][0]            
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 363, 5)       505         batch_normalization_1[0][0]      
                                                                 batch_normalization_1[1][0]      
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 121, 5)       0           conv1d_2[0][0]                   
                                                                 conv1d_2[1][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 121, 5)       20          max_pooling1d_2[0][0]            
                                                                 max_pooling1d_2[1][0]            
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 102, 5)       505         batch_normalization_2[0][0]      
                                                                 batch_normalization_2[1][0]      
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 34, 5)        0           conv1d_3[0][0]                   
                                                                 conv1d_3[1][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 34, 5)        20          max_pooling1d_3[0][0]            
                                                                 max_pooling1d_3[1][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 34, 10)       0           batch_normalization_3[0][0]      
                                                                 batch_normalization_3[1][0]      
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 340)          0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 25)           8525        flatten_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 25)           100         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            26          batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_2[0][0]                    
==================================================================================================
Total params: 12,126
Trainable params: 12,046
Non-trainable params: 80
__________________________________________________________________________________________________
