__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, 1166, 24)     0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, 1166, 24)     0                                            
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 27984)        0           protein1[0][0]                   
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 27984)        0           protein2[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 20)           559700      flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 20)           559700      flatten_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 20)           80          dense_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 20)           80          dense_3[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 20)           420         batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 20)           420         batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 20)           80          dense_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 20)           80          dense_4[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 40)           0           batch_normalization_2[0][0]      
                                                                 batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 20)           820         concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 20)           80          dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1)            21          batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_6[0][0]                    
==================================================================================================
Total params: 1,121,481
Trainable params: 1,121,281
Non-trainable params: 200
__________________________________________________________________________________________________
