__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, 1166, 20)     0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, 1166, 20)     0                                            
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 23320)        0           protein1[0][0]                   
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 23320)        0           protein2[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 8)            186568      flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 8)            186568      flatten_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 8)            32          dense_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 8)            32          dense_3[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 8)            72          batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 8)            72          batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 8)            32          dense_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 8)            32          dense_4[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 16)           0           batch_normalization_2[0][0]      
                                                                 batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 8)            136         concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 8)            32          dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1)            9           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_6[0][0]                    
==================================================================================================
Total params: 373,585
Trainable params: 373,505
Non-trainable params: 80
__________________________________________________________________________________________________
