__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, 1166)         0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, 1166)         0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 1166, 3)      63          protein1[0][0]                   
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 1166, 3)      63          protein2[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1166, 50)     200         embedding_1[0][0]                
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 1166, 50)     200         embedding_2[0][0]                
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 1166, 50)     200         dense_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 1166, 50)     200         dense_7[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1166, 50)     2550        batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1166, 50)     2550        batch_normalization_7[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 1166, 50)     200         dense_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 1166, 50)     200         dense_8[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1166, 50)     2550        batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 1166, 50)     2550        batch_normalization_8[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 1166, 50)     200         dense_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 1166, 50)     200         dense_9[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1166, 50)     2550        batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 1166, 50)     2550        batch_normalization_9[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 1166, 50)     200         dense_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 1166, 50)     200         dense_10[0][0]                   
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 1166, 50)     2550        batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 1166, 50)     2550        batch_normalization_10[0][0]     
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 1166, 50)     200         dense_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 1166, 50)     200         dense_11[0][0]                   
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1166, 1)      51          batch_normalization_5[0][0]      
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 1166, 1)      51          batch_normalization_11[0][0]     
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 1166, 1)      4           dense_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 1166, 1)      4           dense_12[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1166, 2)      0           batch_normalization_6[0][0]      
                                                                 batch_normalization_12[0][0]     
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 2332)         0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 10)           23330       flatten_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 10)           40          dense_13[0][0]                   
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 1)            11          batch_normalization_13[0][0]     
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_14[0][0]                   
==================================================================================================
Total params: 46,417
Trainable params: 45,393
Non-trainable params: 1,024
__________________________________________________________________________________________________
