__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, 1166, 20)     0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, 1166, 20)     0                                            
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 23320)        0           protein1[0][0]                   
                                                                 protein2[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1000)         23321000    flatten_1[0][0]                  
                                                                 flatten_1[1][0]                  
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 1000)         4000        dense_1[0][0]                    
                                                                 dense_1[1][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1000)         1001000     batch_normalization_1[0][0]      
                                                                 batch_normalization_1[1][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 1000)         4000        dense_2[0][0]                    
                                                                 dense_2[1][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 2000)         0           batch_normalization_2[0][0]      
                                                                 batch_normalization_2[1][0]      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 100)          200100      concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 100)          400         dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1)            101         batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_4[0][0]                    
==================================================================================================
Total params: 24,530,601
Trainable params: 24,526,401
Non-trainable params: 4,200
__________________________________________________________________________________________________
