__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, 1166)         0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, 1166)         0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 1166, 128)    2688        protein1[0][0]                   
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 1166, 128)    2688        protein2[0][0]                   
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1166, 128, 1) 0           embedding_1[0][0]                
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 1166, 128, 1) 0           embedding_2[0][0]                
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1157, 64, 10) 6510        reshape_1[0][0]                  
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 1157, 64, 10) 6510        reshape_3[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 578, 64, 10)  0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 578, 64, 10)  0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 571, 64, 10)  810         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 571, 64, 10)  810         max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 285, 64, 10)  0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 285, 64, 10)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 281, 64, 1)   51          max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 281, 64, 1)   51          max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 140, 64, 1)   0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 140, 64, 1)   0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 140, 64)      0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
reshape_4 (Reshape)             (None, 140, 64)      0           max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 80)           46400       reshape_2[0][0]                  
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 80)           46400       reshape_4[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 160)          0           lstm_1[0][0]                     
                                                                 lstm_2[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            161         concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_1[0][0]                    
==================================================================================================
Total params: 113,079
Trainable params: 113,079
Non-trainable params: 0
__________________________________________________________________________________________________
