__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, None, 20)     0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, None, 20)     0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 5)      2005        protein1[0][0]                   
                                                                 protein2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, None, 5)      0           conv1d_1[0][0]                   
                                                                 conv1d_1[1][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 5)      20          max_pooling1d_1[0][0]            
                                                                 max_pooling1d_1[1][0]            
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 5)      505         batch_normalization_1[0][0]      
                                                                 batch_normalization_1[1][0]      
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, None, 5)      0           conv1d_2[0][0]                   
                                                                 conv1d_2[1][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 5)      20          max_pooling1d_2[0][0]            
                                                                 max_pooling1d_2[1][0]            
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 5)      505         batch_normalization_2[0][0]      
                                                                 batch_normalization_2[1][0]      
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, None, 5)      0           conv1d_3[0][0]                   
                                                                 conv1d_3[1][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 5)      20          max_pooling1d_3[0][0]            
                                                                 max_pooling1d_3[1][0]            
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, None, 64)     17920       batch_normalization_3[0][0]      
                                                                 batch_normalization_3[1][0]      
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 64)           33024       lstm_1[0][0]                     
                                                                 lstm_1[1][0]                     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128)          0           lstm_2[0][0]                     
                                                                 lstm_2[1][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 100)          12900       concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 100)          400         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 100)          10100       batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 100)          400         dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 50)           5050        batch_normalization_5[0][0]      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 50)           200         dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 50)           2550        batch_normalization_6[0][0]      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 50)           200         dense_4[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 50)           2550        batch_normalization_7[0][0]      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 50)           200         dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 25)           1275        batch_normalization_8[0][0]      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 25)           100         dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 25)           650         batch_normalization_9[0][0]      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 25)           100         dense_7[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 25)           650         batch_normalization_10[0][0]     
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 25)           100         dense_8[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 25)           650         batch_normalization_11[0][0]     
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 25)           100         dense_9[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 1)            26          batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_10[0][0]                   
==================================================================================================
Total params: 92,220
Trainable params: 91,290
Non-trainable params: 930
__________________________________________________________________________________________________
