__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, None, 20)     0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, None, 20)     0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 5)      2005        protein1[0][0]                   
                                                                 protein2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, None, 5)      0           conv1d_1[0][0]                   
                                                                 conv1d_1[1][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 5)      20          max_pooling1d_1[0][0]            
                                                                 max_pooling1d_1[1][0]            
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 5)      505         batch_normalization_1[0][0]      
                                                                 batch_normalization_1[1][0]      
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, None, 5)      0           conv1d_2[0][0]                   
                                                                 conv1d_2[1][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 5)      20          max_pooling1d_2[0][0]            
                                                                 max_pooling1d_2[1][0]            
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 5)      505         batch_normalization_2[0][0]      
                                                                 batch_normalization_2[1][0]      
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, None, 5)      0           conv1d_3[0][0]                   
                                                                 conv1d_3[1][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 5)      20          max_pooling1d_3[0][0]            
                                                                 max_pooling1d_3[1][0]            
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 64)           17920       batch_normalization_3[0][0]      
                                                                 batch_normalization_3[1][0]      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128)          0           lstm_1[0][0]                     
                                                                 lstm_1[1][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 25)           3225        concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 25)           100         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 25)           650         batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 25)           100         dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            26          batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_3[0][0]                    
==================================================================================================
Total params: 25,096
Trainable params: 24,966
Non-trainable params: 130
__________________________________________________________________________________________________
