__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, None)         0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, None)         0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, None, 64)     1344        protein1[0][0]                   
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, None, 64)     1344        protein2[0][0]                   
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, None, 32)     12416       embedding_1[0][0]                
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, None, 32)     12416       embedding_2[0][0]                
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 32)           8320        lstm_1[0][0]                     
__________________________________________________________________________________________________
lstm_4 (LSTM)                   (None, 32)           8320        lstm_3[0][0]                     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64)           0           lstm_2[0][0]                     
                                                                 lstm_4[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 50)           3250        concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 50)           200         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 50)           2550        batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 50)           200         dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 25)           1275        batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 25)           100         dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1)            26          batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_4[0][0]                    
==================================================================================================
Total params: 51,761
Trainable params: 51,511
Non-trainable params: 250
__________________________________________________________________________________________________
