__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, None)         0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, None)         0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, None, 4)      84          protein1[0][0]                   
                                                                 protein2[0][0]                   
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, None, 64)     17664       embedding_1[0][0]                
                                                                 embedding_1[1][0]                
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 64)           33024       lstm_1[0][0]                     
                                                                 lstm_1[1][0]                     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128)          0           lstm_2[0][0]                     
                                                                 lstm_2[1][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 100)          12900       concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 100)          400         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 100)          10100       batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 100)          400         dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 50)           5050        batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 50)           200         dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 50)           2550        batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 50)           200         dense_4[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 50)           2550        batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 50)           200         dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 25)           1275        batch_normalization_5[0][0]      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 25)           100         dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 25)           650         batch_normalization_6[0][0]      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 25)           100         dense_7[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 25)           650         batch_normalization_7[0][0]      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 25)           100         dense_8[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 25)           650         batch_normalization_8[0][0]      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 25)           100         dense_9[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 1)            26          batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_10[0][0]                   
==================================================================================================
Total params: 88,973
Trainable params: 88,073
Non-trainable params: 900
__________________________________________________________________________________________________
