__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, None, 20)     0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, None, 20)     0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 10)     4010        protein1[0][0]                   
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 10)     4010        protein2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, None, 10)     0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, None, 10)     0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 10)     40          max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 10)     40          max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 10)     2010        batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 10)     2010        batch_normalization_4[0][0]      
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, None, 10)     0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, None, 10)     0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 10)     40          max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, 10)     40          max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 10)     2010        batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, None, 10)     2010        batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, None, 10)     0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, None, 10)     0           conv1d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 10)     40          max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, 10)     40          max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 128)          71168       batch_normalization_3[0][0]      
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 128)          71168       batch_normalization_6[0][0]      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 256)          0           lstm_1[0][0]                     
                                                                 lstm_2[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 50)           12850       concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 50)           200         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 25)           1275        batch_normalization_7[0][0]      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 25)           100         dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            26          batch_normalization_8[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_3[0][0]                    
==================================================================================================
Total params: 173,087
Trainable params: 172,817
Non-trainable params: 270
__________________________________________________________________________________________________
