__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, None)         0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, None)         0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, None, 128)    2688        protein1[0][0]                   
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, None, 128)    2688        protein2[0][0]                   
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 10)     25610       embedding_1[0][0]                
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 10)     25610       embedding_2[0][0]                
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, None, 10)     0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, None, 10)     0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 10)     2010        max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 10)     2010        max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, None, 10)     0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, None, 10)     0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, None, 64)     19200       max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, None, 64)     19200       max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 64)           33024       lstm_1[0][0]                     
__________________________________________________________________________________________________
lstm_4 (LSTM)                   (None, 64)           33024       lstm_3[0][0]                     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128)          0           lstm_2[0][0]                     
                                                                 lstm_4[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            129         concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_1[0][0]                    
==================================================================================================
Total params: 165,193
Trainable params: 165,193
Non-trainable params: 0
__________________________________________________________________________________________________
