__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, None, 20)     0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, None, 20)     0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 5)      2005        protein1[0][0]                   
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 5)      2005        protein2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, None, 5)      0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, None, 5)      0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 5)      20          max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 5)      20          max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 5)      505         batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 5)      505         batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, None, 5)      0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, None, 5)      0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 5)      20          max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 5)      20          max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 32)           4864        batch_normalization_2[0][0]      
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 32)           4864        batch_normalization_4[0][0]      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64)           0           lstm_1[0][0]                     
                                                                 lstm_2[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 25)           1625        concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 25)           100         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            26          batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_2[0][0]                    
==================================================================================================
Total params: 16,579
Trainable params: 16,489
Non-trainable params: 90
__________________________________________________________________________________________________
