__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, 1166)         0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, 1166)         0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 1166, 5)      105         protein1[0][0]                   
                                                                 protein2[0][0]                   
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 64)           17920       embedding_1[0][0]                
                                                                 embedding_1[1][0]                
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128)          0           lstm_1[0][0]                     
                                                                 lstm_1[1][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 50)           6450        concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 50)           200         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 25)           1275        batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 25)           100         dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            26          batch_normalization_2[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_3[0][0]                    
==================================================================================================
Total params: 26,076
Trainable params: 25,926
Non-trainable params: 150
__________________________________________________________________________________________________
