__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
protein1 (InputLayer)           (None, None, 20)     0                                            
__________________________________________________________________________________________________
protein2 (InputLayer)           (None, None, 20)     0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 5)      2005        protein1[0][0]                   
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 5)      2005        protein2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, None, 5)      0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, None, 5)      0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 5)      20          max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 5)      20          max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 5)      505         batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 5)      505         batch_normalization_4[0][0]      
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, None, 5)      0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, None, 5)      0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 5)      20          max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, 5)      20          max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 5)      505         batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, None, 5)      505         batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, None, 5)      0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, None, 5)      0           conv1d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 5)      20          max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, 5)      20          max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 32)           4864        batch_normalization_3[0][0]      
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 32)           4864        batch_normalization_6[0][0]      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64)           0           lstm_1[0][0]                     
                                                                 lstm_2[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 50)           3250        concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 50)           200         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 40)           2040        batch_normalization_7[0][0]      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 40)           160         dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 30)           1230        batch_normalization_8[0][0]      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 30)           120         dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 20)           620         batch_normalization_9[0][0]      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 20)           80          dense_4[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 10)           210         batch_normalization_10[0][0]     
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 10)           40          dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1)            11          batch_normalization_11[0][0]     
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_6[0][0]                    
==================================================================================================
Total params: 23,839
Trainable params: 23,479
Non-trainable params: 360
__________________________________________________________________________________________________
